api1/app/controllers/articles_controller.rb

	def index
		render json:Article.all #Article is an activemodel record which has many methods ,one of them is .all
---
SELECT "articles".* FROM "articles"

	def create
		article=Article.create(article_params)
---
INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "t2"], ["content", "c2"], ["created_at", "2021-02-11 08:27:56.187523"], ["updated_at", "2021-02-11 08:27:56.187523"]]

	def update
		article=Article.find(params[:id])
		article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "t412"], ["updated_at", "2021-02-11 11:04:53.687061"], ["id", 1]]

	def edit
		article=Article.find(params[:id])
		article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "title test122"], ["updated_at", "2021-02-11 11:25:37.136764"], ["id", 6]]

	def destroy		#using url params method=delete
		Article.destroy(params[:id])
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]

	def delete	#using body params method=POST
		Article.destroy(params[:id])
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]